xmRookie/STM32F7_MENU/f765_0127_test_ok1/app/ethernetif.c
            /* Point to next descriptor */
            DmaTxDesc = (ETH_DMADescTypeDef *)(DmaTxDesc->Buffer2NextDescAddr);

            /* Check if the buffer is available */
            if((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET) {
                errval = ERR_USE;
                goto error;
            }

            buffer = (uint8_t *)(DmaTxDesc->Buffer1Addr);

            byteslefttocopy = byteslefttocopy - (ETH_TX_BUF_SIZE - bufferoffset);
            payloadoffset = payloadoffset + (ETH_TX_BUF_SIZE - bufferoffset);
            framelength = framelength + (ETH_TX_BUF_SIZE - bufferoffset);
            bufferoffset = 0;
        }

        /* Copy the remaining bytes */
        memcpy((uint8_t*)((uint8_t*)buffer + bufferoffset), (uint8_t*)((uint8_t*)q->payload + payloadoffset), byteslefttocopy);
        bufferoffset = bufferoffset + byteslefttocopy;
        framelength = framelength + byteslefttocopy;
    }
    /* Prepare transmit descriptors to give to DMA */
    HAL_ETH_TransmitFrame(&heth, framelength);

    errval = ERR_OK;

error:

    /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
    if((heth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t)RESET) {
        /* Clear TUS ETHERNET DMA flag */
        heth.Instance->DMASR = ETH_DMASR_TUS;

        /* Resume DMA transmission*/
        heth.Instance->DMATPDR = 0;
    }
	//printf("DMASR %d\n",heth.Instance->DMASR);
    return errval;
}


uint32_t udp_ts_output(struct netif *netif, struct pbuf *p,uint8_t *buf,uint32_t pos)
{
    uint32_t errval;
    struct pbuf *q;
    uint8_t *buffer = (uint8_t *)(heth.TxDesc->Buffer1Addr);
    __IO ETH_DMADescTypeDef *DmaTxDesc;
    uint32_t framelength = 0;
	uint32_t hearlength = 0;
	uint32_t read = 0;
	uint16_t i;
	uint16_t datlen;
	uint8_t *dat;

    DmaTxDesc = heth.TxDesc;
    //bufferoffset = 0;
	q = p;
	dat = buf;
	read= pos;

    /* copy frame from pbufs to driver buffers */
    //for(q = p; q != NULL; q = q->next) 
    framelength = q->tot_len;
	
	//printf(" \r\nframelength %d \r\n",framelength);        //q->tot_len = 42 + data_length
	
	datlen =  q->len;
	hearlength= framelength - datlen;

	if(framelength>ETH_RX_BUF_SIZE)
	{
	    errval = 0;
		goto error;
	}
    /* Is this buffer available? If not, goto error */
    if((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET) {
        errval = 0;
        goto error;
    }

    /* Copy the remaining bytes */
    memcpy((uint8_t*)((uint8_t*)buffer), (uint8_t*)((uint8_t*)q->payload), hearlength);

    for(i = 0; i < datlen; i++) {

	    buffer[hearlength+i] = dat[read];       
		read = RBUF_NEXT_PT(read, 1, UDP_BUF_SIZE);
    }
    /* Prepare transmit descriptors to give to DMA */
    //HAL_ETH_TransmitFrame(&heth,framelength);
		
	//	printf("DMASR %x\r\n",heth.Instance->DMASR);
		
	if(HAL_OK != HAL_ETH_TransmitFrame(&heth, framelength)) {
	    errval = pos;
	}
	else
	{
    	errval = read;
	}

error:

    /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
    if((heth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t)RESET) {
		printf("DMASR error ETH_DMASR_TUS %d\r\n",heth.Instance->DMASR);
        /* Clear TUS ETHERNET DMA flag */
        heth.Instance->DMASR = ETH_DMASR_TUS;

        /* Resume DMA transmission*/
        heth.Instance->DMATPDR = 0;
    }
	//printf("DMASR %x\r\n",heth.Instance->DMASR);
    return errval;
}

#if 0
err_t udp_ts_output(struct netif *netif, struct pbuf *p)
{
    err_t errval;
    struct pbuf *q;
    uint8_t *buffer = (uint8_t *)(heth.TxDesc->Buffer1Addr);
    __IO ETH_DMADescTypeDef *DmaTxDesc;
    uint32_t framelength = 0;
	//uint8_t i,*dat;
    DmaTxDesc = heth.TxDesc;
    //bufferoffset = 0;
	  q = p;
    /* copy frame from pbufs to driver buffers */
    //for(q = p; q != NULL; q = q->next) 
    framelength = q->len;
	//if(q->len)
	//{
	//dat = q->payload;
	//	for(i=0;i<42;i++)
	//		printf("0x%x,",dat[i]);
	//}
	if(framelength>ETH_RX_BUF_SIZE)
	{
	    errval = ERR_USE;
		goto error;
	}
    /* Is this buffer available? If not, goto error */
    if((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET) {
        errval = ERR_USE;
        goto error;
    }

    /* Copy the remaining bytes */
    memcpy((uint8_t*)((uint8_t*)buffer), (uint8_t*)((uint8_t*)q->payload), framelength);
   
    /* Prepare transmit descriptors to give to DMA */
    HAL_ETH_TransmitFrame(&heth,framelength);

    errval = ERR_OK;

error:

    /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
    if((heth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t)RESET) {
        /* Clear TUS ETHERNET DMA flag */
        heth.Instance->DMASR = ETH_DMASR_TUS;

        /* Resume DMA transmission*/
        heth.Instance->DMATPDR = 0;
    }
	//printf("DMASR %d\n",heth.Instance->DMASR);
    return errval;
}
#endif

/**
 * Should allocate a pbuf and transfer the bytes of the incoming
 * packet from the interface into the pbuf.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return a pbuf filled with the received packet (including MAC header)
 *         NULL on memory error
   */



static struct pbuf * low_level_input(struct netif *netif)
{
    struct pbuf *p = NULL;
    struct pbuf *q = NULL;
    uint16_t len = 0;
    uint8_t *buffer;
    __IO ETH_DMADescTypeDef *dmarxdesc;
    uint32_t bufferoffset = 0;
    uint32_t payloadoffset = 0;
    uint32_t byteslefttocopy = 0;
    uint32_t i = 0;


    /* get received frame */
//  if(HAL_ETH_GetReceivedFrame(&heth) != HAL_OK){
	if(HAL_ETH_GetReceivedFrame_IT(&heth) != HAL_OK){
			//printf("none ");
        return NULL;
		}

    /* Obtain the size of the packet and put it into the "len" variable. */
    len = heth.RxFrameInfos.length;
    buffer = (uint8_t *)heth.RxFrameInfos.buffer;


		
    if(len > 0) {
        /* We allocate a pbuf chain of pbufs from the Lwip buffer pool */
        p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
    }

    if(p != NULL) {
        dmarxdesc = heth.RxFrameInfos.FSRxDesc;
        bufferoffset = 0;

        for(q = p; q != NULL; q = q->next) {
            byteslefttocopy = q->len;
            payloadoffset = 0;

            /* Check if the length of bytes to copy in current pbuf is bigger than Rx buffer size*/
            while((byteslefttocopy + bufferoffset) > ETH_RX_BUF_SIZE) {
                /* Copy data to pbuf */
                memcpy((uint8_t*)((uint8_t*)q->payload + payloadoffset), (uint8_t*)((uint8_t*)buffer + bufferoffset), (ETH_RX_BUF_SIZE - bufferoffset));

