xmRookie/STM32F7_MENU/f765_0127_test_ok1/app/ethernetif.c
                /* Check for the Timeout ( 1s ) */
                if((HAL_GetTick() - tickstart) > 1000) {
                    /* In case of timeout */
                    goto error;
                }
            } while(((regvalue & PHY_AUTONEGO_COMPLETE) != PHY_AUTONEGO_COMPLETE));

            /* Read the result of the auto-negotiation */
            HAL_ETH_ReadPHYRegister(&heth, PHY_SR, &regvalue);

            /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
            if((regvalue & PHY_DUPLEX_STATUS) != (uint32_t)RESET) {
                /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
                heth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
            } else {
                /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
                heth.Init.DuplexMode = ETH_MODE_HALFDUPLEX;
            }

            /* Configure the MAC with the speed fixed by the auto-negotiation process */
            if(regvalue & PHY_SPEED_STATUS) {
                /* Set Ethernet speed to 10M following the auto-negotiation */
                heth.Init.Speed = ETH_SPEED_10M;
            } else {
                /* Set Ethernet speed to 100M following the auto-negotiation */
                heth.Init.Speed = ETH_SPEED_100M;
            }
        } else { /* AutoNegotiation Disable */
error :
            /* Check parameters */
            assert_param(IS_ETH_SPEED(heth.Init.Speed));
            assert_param(IS_ETH_DUPLEX_MODE(heth.Init.DuplexMode));

            /* Set MAC Speed and Duplex Mode to PHY */
            HAL_ETH_WritePHYRegister(&heth, PHY_BCR, ((uint16_t)(heth.Init.DuplexMode >> 3) |
                                     (uint16_t)(heth.Init.Speed >> 1)));
        }

        /* ETHERNET MAC Re-Configuration */
        HAL_ETH_ConfigMAC(&heth, (ETH_MACInitTypeDef *) NULL);

        /* Restart MAC interface */
        HAL_ETH_Start(&heth);
    } else {
        /* Stop MAC interface */
        HAL_ETH_Stop(&heth);
    }

    ethernetif_notify_conn_changed(netif);
}

/**
  * @brief  This function notify user about link status changement.
  * @param  netif: the network interface
  * @retval None
  */
__weak void ethernetif_notify_conn_changed(struct netif *netif)
{
    /* NOTE : This is function could be implemented in user file
              when the callback is needed,
    */

}

#endif /* LWIP_NETIF_LINK_CALLBACK */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/








extern void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef * heth)
{
    printf("HAL_ETH_TxCpltCallback\r\n");
}

extern void HAL_ETH_ErrorCallback(ETH_HandleTypeDef * heth)
{
    printf("HAL_ETH_ErrorCallback\n");
}


















/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/












uint16_t Eth_Buf_Read=0;
uint16_t Eth_Buf_Write=0;
uint8_t Eth_Buf[256][3]={0};


uint8_t dstpot_1;
uint8_t dstpot_2;

extern void Eth_Send_api(uint8_t *Data,uint16_t Data_Len)
{
	eth_send(Data,dstpot_1,dstpot_2,Data_Len);                //add destination port
}


extern void pollint_eth_send(void)
{                            
 	if(Eth_Buf_Read != Eth_Buf_Write){
		
		if(Eth_Buf[Eth_Buf_Read][0] == 0x02 || Eth_Buf[Eth_Buf_Read][0] == 0x03){     //  QT_eth <-->  stm32
//			Eth_Buf_Read = RBUF_NEXT_PT(Eth_Buf_Read, 1, 256);
			
			Send_User_Data(Eth_Buf[Eth_Buf_Read],3);
			
		}else if(Eth_Buf[Eth_Buf_Read][0] == 0x00 || Eth_Buf[Eth_Buf_Read][0] == 0x01){     //  QT_eth <-->  stm32  <-->  FPGA
//			Eth_Buf_Read = RBUF_NEXT_PT(Eth_Buf_Read, 1, 256);
#ifndef FPGA_LINK			
			//Send_User_Data(Eth_Buf[Eth_Buf_Read],3);                         //test
			eth_send(Eth_Buf[Eth_Buf_Read],dstpot_1,dstpot_2,3);             //test
#else			
			Send_To_Fpga(Eth_Buf[Eth_Buf_Read],3);                              //use
#endif			
			
		}		
		Eth_Buf_Read = RBUF_NEXT_PT(Eth_Buf_Read, 1, 256);
	}
}

#if 1
extern uint16_t   eth_irq_input(ETH_HandleTypeDef * heth_1)
{
 	static uint8_t j=0;
    uint16_t len = 0;
    uint8_t *buffer;
    uint32_t i = 0;


    /* Obtain the size of the packet and put it into the "len" variable. */
    len = heth.RxFrameInfos.length;
    buffer = (uint8_t *)heth.RxFrameInfos.buffer;
		
//	USART3_Putchar(j);
//		j++;
//		if(j>255)
//			j=0;
	
//	USART3_Putchar(buffer[43]);
	
	
	if(buffer[36] == 0x50 && buffer[37] == 0x04){	
		//存数据
	//	printf("= ");
			//memcpy(Eth_Buf[Eth_Buf_Write],&buffer[42],3);
		memcpy(Eth_Buf[Eth_Buf_Write],buffer+42,3);
		  Eth_Buf_Write = RBUF_NEXT_PT(Eth_Buf_Write, 1, 256);
			dstpot_1 = buffer[34];
			dstpot_2 = buffer[35];
		
	}
	//	printf("eth_irq_input len = %d",len);
    
}
#else
extern uint16_t   eth_irq_input(uint8_t *payload)
{
   
    uint16_t len = 0;
    uint8_t *buffer;
    __IO ETH_DMADescTypeDef *dmarxdesc;

    uint32_t i = 0;


    /* get received frame */
    if(HAL_ETH_GetReceivedFrame(&heth) != HAL_OK)
        return 0 ;

    /* Obtain the size of the packet and put it into the "len" variable. */
    len = heth.RxFrameInfos.length;
    buffer = (uint8_t *)heth.RxFrameInfos.buffer;

     /* Copy remaining data in pbuf */
     //memcpy((uint8_t*)((uint8_t*)payload ), (uint8_t*)((uint8_t*)buffer), len);
	//nicIP(buffer,len);
			if(buffer[36] == 0x50 && buffer[37] == 0x04)
					eth_send(buffer,buffer[34],buffer[35]);
    /* Release descriptors to DMA */
    /* Point to first descriptor */
    dmarxdesc = heth.RxFrameInfos.FSRxDesc;

    /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
    for(i = 0; i < heth.RxFrameInfos.SegCount; i++) {
        dmarxdesc->Status |= ETH_DMARXDESC_OWN;
        dmarxdesc = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
    }

    /* Clear Segment_Count */
    heth.RxFrameInfos.SegCount = 0;

    /* When Rx Buffer unavailable flag is set: clear it and resume reception */
    if((heth.Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t)RESET) {
        /* Clear RBUS ETHERNET DMA flag */
        heth.Instance->DMASR = ETH_DMASR_RBUS;
        /* Resume DMA reception */
        heth.Instance->DMARPDR = 0;
    }
	
	return len;
}
#endif
extern void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef * heth)
{
	
	eth_irq_input(heth);

	
	
 //   printf("HAL_ETH_RxCpltCallback\r\n");
}

/*
extern uint8_t Get_Link_Status(void)
{
	uint32_t regvalue=0;
	HAL_ETH_ReadPHYRegister(&heth, 0x1b, &regvalue); //501 link up   504 link down
	if(	regvalue & 0004 ){
		return 0;       //link down
	}else if(regvalue & 0001){
		return 1;       //link up
	}
}
*/



extern void Link_Callback(void)
{
	uint32_t regvalue=0;
	HAL_ETH_ReadPHYRegister(&heth, PHY_ITSCR, &regvalue); //501 link up   504 link down
	
	printf(" Link_Callback ");
	
	if(	regvalue & LINK_DOWN_OCCURRED ){
		set_remoteLwip_udp_link(NET_UNLINK);
		printf("LINK_DOWN\r\n");
	}
	if(	regvalue & LINK_UP_OCCURRED ){
		set_remoteLwip_udp_link(NET_LINKED);
		printf("LINK_DOWN\r\n");
	}
}

extern uint8_t Read_Eth_Link_Status(void)
{
	uint32_t regvalue=0;
	HAL_ETH_ReadPHYRegister(&heth, 0x01, &regvalue); //501 link up   504 link down
	
	if(regvalue == 0x784d){     //网络联通
		return 1;
	}else if(regvalue == 0x7849){    //网络断开
		return 0;
	}else{                                                 //网络出差错
		Set_Status(1);     //eth_error !  phy值不正常  可能是MDC  MDIO 有问题
		return 2;
	}
	
	//return regvalue;
}

